# -*- coding: utf-8 -*-

DEFAULT_COLUMNS = {
    "key_candidates": ["Артикул", "Код", "SKU", "ID", "Код товара"],
    "name_candidates": ["Препарат", "Наименование", "Наименование препарата", "Наименование товаров", "Наименование товара", "Наименование препаратов", "Наименование медикаментов", "Товары", "Махсулот номи", "Номенклатура", "Товар", "Название", "Name", "Позиция"],
    "price_candidates": ["-4", "-3", "-2", "Цена-4", "Цена 4", "Цена - 4", "Цена-3", "Цена 3", "Цена - 3", "Цена отпускная под 100%", "Цена", "Цена сум", "Цена (100%) с НДС", "Цена При 100 % оплате цена", "При 100 % оплате цена", "Тип цены Сотув", "Цена 100%", "Цена с НДС 100%", "Цена для клиента с предоплатой 100%", "Цена отпускная под 25%", "Цена Спец мин 1млн", "Тип цены При 100% Оплате (перечисление)", "При 100% Оплате", "Цена договорная", "Цена (с НДС)", "Цена Договорная", "Цена переч", "Цена переч:", "Цена реал", "ПриходЦена", "Сумма заказ", "Сумма", "Отп. Цена", "Price", "Нарх", "Розница", "Опт", "Стоимость", "Тариф", "Продажная", "Продажная цена", "Продажная с НДС"],
    "stock_candidates": ["Остаток", "Количество", "Склад", "Доступно", "Кол-во"],
    "producer_candidates": ["Производитель", "Произ.", "Произв.", "Произ", "Произв", "Бренд", "Завод", "Фирма"]
}

DEFAULT_PRODUCERS = ["материа", "materia"]
