# -*- coding: utf-8 -*-

DEFAULT_COLUMNS = {
    "key_candidates": ["Артикул", "Код", "SKU", "ID", "Код товара"],
    "name_candidates": ["Препарат", "Наименование", "Наименование препарата", "Наименование товаров", "Наименование товара", "Наименование препаратов", "Наименование медикаментов", "Товары", "Махсулот номи", "Номи", "Товар номи", "Препарат номи", "Махсулот", "Номенклатура", "Товар", "Название", "Name", "Позиция"],
    "price_candidates": ["-4", "-4%", "Цена -4%", "Цена-4%", "Цена - 4%", "-3", "-3%", "Цена -3%", "Цена-3%", "Цена - 3%", "-2", "-2%", "Цена -2%", "Цена-2%", "Цена - 2%", "Цена-4", "Цена 4", "Цена - 4", "Цена -4", "Цена-3", "Цена 3", "Цена - 3", "Цена -3", "Цена-2", "Цена 2", "Цена - 2", "Цена -2", "Цена отпускная под 100%", "Цена", "Цена сум", "Цена (100%) с НДС", "Цена При 100 % оплате цена", "При 100 % оплате цена", "Тип цены Сотув", "Цена 100%", "Цена с НДС 100%", "Цена для клиента с предоплатой 100%", "Цена отпускная под 25%", "Цена Спец мин 1млн", "Тип цены При 100% Оплате (перечисление)", "При 100% Оплате", "Цена договорная", "Цена (с НДС)", "Цена с НДС", "Цена Договорная", "Цена переч", "Цена переч:", "Цена реал", "ПриходЦена", "Сумма заказ", "Сумма", "Отп. Цена", "Price", "Нарх", "Нархи", "Сотув нархи", "100% тўлов", "100% тулов", "Пул кўчириш", "Пул кучириш", "Накд", "Розница", "Опт", "Цена опт.", "Цена опт", "Цена Опт", "Цена Опт.", "Стоимость", "Тариф", "Продажная", "Продажная цена", "Продажная с НДС", "Цена 1", "Цена 2", "Цена со скидкой", "Перечисление", "Прайс", "Прайс цена", "Нархи сум", "Сотув", "Оптовая", "Оптовая цена", "Опт цена", "Цена клиента", "Нарх (сум)", "Отпускная цена с НДС", "Отпускная цена", "Отп. цена с НДС", "100%", "1"],
    "stock_candidates": ["Остаток", "Количество", "Склад", "Доступно", "Кол-во", "Микдор", "Миқдор", "Қолдиқ", "Колдик"],
    "producer_candidates": ["Производитель", "Произ.", "Произв.", "Произ", "Произв", "Бренд", "Завод", "Фирма", "Ишлаб чикарувчи", "Ишлаб чиқарувчи", "Давлат", "Производство"]
}

DEFAULT_PRODUCERS = ["материа", "materia", "материя"]
